
**@flexwie suggests the following changes in this pull_request:**  

```terraform

Acquiring state lock. This may take a few moments...
hcloud_network.network: Refreshing state... [id=1253117]
hcloud_network_subnet.subnet: Refreshing state... [id=1253117-10.0.1.0/24]
hcloud_server.node1: Refreshing state... [id=15644423]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.db1 will be created
  + resource "hcloud_server" "db1" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "redis" = "1"
        }
      + location           = "nbg1"
      + name               = "db1"
      + rebuild_protection = false
      + server_type        = "cx11"
      + ssh_keys           = [
          + "3939407",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.6"
          + mac_address = (known after apply)
          + network_id  = 1253117
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: iaac.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "iaac.tfplan"
Releasing state lock. This may take a few moments...

```

